; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v2 - type_3 ?v8 - type_1)
 	      (pred_3 ?v4 - object ?v8 - type_1)
	      (pred_4 ?v2 - type_3 ?v5 - type_2)
	      (pred_2 ?v2 - type_3 ?v4 - object ?v5 - type_2))

   (:action op_3
       :parameters  (?v2 - type_3 ?v6 ?v3 - type_1)
       :precondition (and  (pred_1 ?v2 ?v6))
       :effect (and  (pred_1 ?v2 ?v3)
		     (not (pred_1 ?v2 ?v6))))

   (:action op_1
       :parameters (?v2 - type_3 ?v7 - object ?v1 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v7 ?v1) (pred_1 ?v2 ?v1) (pred_4 ?v2 ?v5))
       :effect (and (pred_2 ?v2 ?v7 ?v5)
		    (not (pred_3 ?v7 ?v1)) 
		    (not (pred_4 ?v2 ?v5))))

   (:action op_2
       :parameters (?v2 - type_3 ?v7 - object ?v1 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v2 ?v7 ?v5) (pred_1 ?v2 ?v1))
       :effect (and (pred_3 ?v7 ?v1)
		    (pred_4 ?v2 ?v5)
		    (not (pred_2 ?v2 ?v7 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_05 obj_04 - type_3
obj_10 obj_08 obj_06 obj_11 - type_2
obj_07 obj_01 obj_12 obj_13 - type_1
obj_03 obj_02 obj_09 - object)
(:init
(pred_1 obj_05 obj_01)
(pred_4 obj_05 obj_10)
(pred_4 obj_05 obj_08)
(pred_1 obj_04 obj_01)
(pred_4 obj_04 obj_06)
(pred_4 obj_04 obj_11)
(pred_3 obj_03 obj_07)
(pred_3 obj_02 obj_12)
(pred_3 obj_09 obj_13)
)
(:goal
(and
(pred_3 obj_03 obj_13)
(pred_3 obj_02 obj_01)
(pred_3 obj_09 obj_01)
)
)

(:constraints
  (always (not (pred_1 obj_05 obj_12)))
)
)

; plan
1. (op_3 obj_05 obj_01 obj_13)
   deleted: (pred_1 obj_05 obj_01)
   added: (pred_1 obj_05 obj_13)
   goals met: 0 of 3
2. (op_3 obj_04 obj_01 obj_13)
   deleted: (pred_1 obj_04 obj_01)
   added: (pred_1 obj_04 obj_13)
   goals met: 0 of 3
3. (op_1 obj_05 obj_09 obj_13 obj_08)
   deleted: (pred_3 obj_09 obj_13) (pred_4 obj_05 obj_08)
   added: (pred_2 obj_05 obj_09 obj_08)
   goals met: 0 of 3
4. (op_3 obj_04 obj_13 obj_12)
   deleted: (pred_1 obj_04 obj_13)
   added: (pred_1 obj_04 obj_12)
   goals met: 0 of 3
5. (op_3 obj_05 obj_13 obj_01)
   deleted: (pred_1 obj_05 obj_13)
   added: (pred_1 obj_05 obj_01)
   goals met: 0 of 3
6. (op_1 obj_04 obj_02 obj_12 obj_11)
   deleted: (pred_3 obj_02 obj_12) (pred_4 obj_04 obj_11)
   added: (pred_2 obj_04 obj_02 obj_11)
   goals met: 0 of 3
7. (op_2 obj_05 obj_09 obj_01 obj_08)
   deleted: (pred_2 obj_05 obj_09 obj_08)
   added: (pred_3 obj_09 obj_01) (pred_4 obj_05 obj_08)
   goals met: 1 of 3
8. (op_3 obj_04 obj_12 obj_07)
   deleted: (pred_1 obj_04 obj_12)
   added: (pred_1 obj_04 obj_07)
   goals met: 1 of 3
9. (op_1 obj_04 obj_03 obj_07 obj_06)
   deleted: (pred_3 obj_03 obj_07) (pred_4 obj_04 obj_06)
   added: (pred_2 obj_04 obj_03 obj_06)
   goals met: 1 of 3
10. (op_3 obj_04 obj_07 obj_13)
   deleted: (pred_1 obj_04 obj_07)
   added: (pred_1 obj_04 obj_13)
   goals met: 1 of 3
11. (op_2 obj_04 obj_03 obj_13 obj_06)
   deleted: (pred_2 obj_04 obj_03 obj_06)
   added: (pred_3 obj_03 obj_13) (pred_4 obj_04 obj_06)
   goals met: 2 of 3
12. (op_3 obj_04 obj_13 obj_01)
   deleted: (pred_1 obj_04 obj_13)
   added: (pred_1 obj_04 obj_01)
   goals met: 2 of 3
13. (op_2 obj_04 obj_02 obj_01 obj_11)
   deleted: (pred_2 obj_04 obj_02 obj_11)
   added: (pred_3 obj_02 obj_01) (pred_4 obj_04 obj_11)
   goals met: 3 of 3
